20251221T163444--kdoc-516-2025年をまとめる__draft_essay.org
:properties:
:ID: 20251221T163444
:end:
#+title:      KDOC 516: 2025年をまとめる
#+date:       [2025-12-21 Sun 16:34]
#+filetags:   :draft:essay:
#+identifier: 20251221T163444

#+begin_comment
(kd/denote-kdoc-rename)
(kd/denote-format)

====ポリシー。
1ファイル1アイデア。
1ファイルで内容を完結させる。
常にほかのエントリとリンクする。
自分の言葉を使う。
参考文献を残しておく。
文献メモの場合は、感想と混ぜないこと。1つのアイデアに反する
ツェッテルカステンの議論に寄与するか。それで本を書けと言われて書けるか
頭のなかやツェッテルカステンにある問いとどのようにかかわっているか
エントリ間の接続を発見したら、接続エントリを追加する。カード間にあるリンクの関係を説明するカード。
アイデアがまとまったらアウトラインエントリを作成する。リンクをまとめたエントリ。
エントリを削除しない。古いカードのどこが悪いかを説明する新しいカードへのリンクを追加する。
恐れずにカードを追加する。無意味の可能性があっても追加しておくことが重要。
個人の感想・意思表明ではない。事実や書籍情報に基づいている

====永久保存メモのルール。
自分の言葉で書く。
後から読み返して理解できる。
他のメモと関連付ける。
ひとつのメモにひとつのことだけを書く。
メモの内容は1枚で完結させる。
論文の中に組み込み、公表できるレベルである。

====水準を満たす価値があるか。
その情報がどういった文脈で使えるか。
どの程度重要な情報か。
そのページのどこが本当に必要な部分なのか。
公表できるレベルの洞察を得られるか

====フロー。
1. 「走り書きメモ」「文献メモ」を書く
2. 1日1回既存のメモを見て、自分自身の研究、思考、興味にどのように関係してくるかを見る
3. 追加すべきものだけ追加する

#+end_comment

* この文書のステータス
- 作成
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))
- レビュー
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))

# チェックリスト ================
# 関連をつけた。
# タイトルがフォーマット通りにつけられている。
# 内容をブラウザに表示して読んだ(作成とレビューのチェックは同時にしない)。
# 文脈なく読めるのを確認した。
# おばあちゃんに説明できる。
# いらない見出しを削除した。
# タグを適切にした。
# すべてのコメントを削除した。
* 概要
# 本文(見出しも設定する)

メモから思い出す。

- KDOC番号は 330 ~ 519
- ネットワークまわりの本をよく読んだ

仕事。

- 前半は自社アプリケーションの開発をやっていた。ハイライトとして、権限の内部実装の大きな変更をするのをやった。変更が巨大な割に機能的なところではないのでリリースには書きにくかった
- 中盤から生成AIを使い始め、コードをゼロから書くことがほとんどなくなっていった
- 9月ごろから主にインフラまわりの受託仕事をやっていた。ドメインからはじまりアプリケーションに必要なマネージドサービスを一通り扱った

個人的イベント。

- 英語でYouTubeを見るのに熱中する。いままでは外国語を文字を *読む* ことで学ぼうとすることが多かったが、動画で見ると大変面白くて永遠に見られることに気づいた。そして動画を見るうちに、国外の場所や人により親しみを感じるようになった。外国語の堪能な人がよくいう、外国語というよりその言語のコンテンツに没頭してできるようになった、の正しさを感じた
- 1ヶ月間アメリカに行った。英語で国外のコンテンツを見るうち、じっさいに行ってみたくなったのである。アメリカでは予約やメモをする以外はPCに全然触れず、ほとんど外にいて遊び回った。都市や自然の名所、博物館、美術館が主な行き先だった
- 休日よく博物館に行った。あまり行ってない時期もあったが、休日の午前に行くとよいことに気づいて安定した
- 毎日5分やる習慣が完全に定着した
  - 6月ごろに[[id:20250611T180912][KDOC 385: 『続ける思考』]]を読んでやりはじめ、それから1日も欠かさず半年間やった
  - 去年から続く[[id:20240708T214636][KDOC 197: 『プリズナー・トレーニング』]]に続く習慣上のブレイクスルーであり、継続力に大きな改善をもたらした
- 後半からモバイル回線にもDNSフィルタリングを設定して、有害コンテンツを完全に遮断する生活をしていた。とくにポルノ依存に対する絶大な効果があった

個人的開発。

- 2Dローグライクの開発を大きく進めた。熱中しては静まって、を数回繰り返した。ゲームとして最低限成り立つまであと少しなのだが、なかなか手につかない
- Go言語のコミットを読んでいく、というのを前半していたが果てしなさ過ぎてやめてしまった。深堀りするネタや意外な過去実装を発見できたのはよかった
- Cloudflare Tunnel を使った自宅サーバを動かし始めた。インターネット公開する自由度が高まった
  - 7年ほど契約し続けてきたレンタルサーバを解約して、自宅サーバに移行した。微妙に使っているところもあったのだが、時間をとってまとめて切り替えた
  - 保有PDFをインターネットを介してどこからでも見られるようにした。Cloudflareが認証をやってくれるので非常に簡単であった

* 関連
# 関連するエントリ。書いているファイルから見て、なぜ関連させたか書く。意味のあるつながりを意識的につくる。
# [引用、整合性、どう説明できるか、矛盾、補っているか、以前聞いたこと、対立、修正、補足、付け加え、組み合わせ、疑問]
# また、現在はリンクが見つからなくてもこういった切り口で将来関連させられそうな項目を書いておく
# [類推、未解決、具体例、追加調査、理由、動機、検証]
# 横に類推するか、上に抽象化するか、下に具体化するか

- 類推: [[id:20240203T020208][KDOC 67: 2023年をまとめる]]。同様に1年を振り返る
  - 2024年は抜けていることに気づいた
