20251221T163444--kdoc-516-2025年をまとめる__draft_essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-01-09T09:24:12Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 516: 2025年をまとめる</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 516: 2025年をまとめる</h1>
<div id="outline-container-orgb357abc" class="outline-2">
<h2 id="orgb357abc"><a href="#orgb357abc">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgb357abc">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb16d75f" class="outline-2">
<h2 id="orgb16d75f"><a href="#orgb16d75f">概要</a></h2>
<div class="outline-text-2" id="text-orgb16d75f">
<p>
メモから思い出す。
</p>

<ul class="org-ul">
<li>KDOC番号は 330 ~ 519</li>
<li>ネットワークまわりの本をよく読んだ</li>
</ul>

<p>
仕事。
</p>

<ul class="org-ul">
<li>前半は自社アプリケーションの開発をやっていた。ハイライトとして、権限の内部実装の大きな変更をするのをやった。変更が巨大な割に機能的なところではないのでリリースには書きにくかった</li>
<li>中盤から生成AIを使い始め、コードをゼロから書くことがほとんどなくなっていった</li>
<li>9月ごろから主にインフラまわりの受託仕事をやっていた。ドメインからはじまりアプリケーションに必要なマネージドサービスを一通り扱った</li>
</ul>

<p>
個人的イベント。
</p>

<ul class="org-ul">
<li>英語でYouTubeを見るのに熱中する。いままでは外国語を文字を <b>読む</b> ことで学ぼうとすることが多かったが、動画で見ると大変面白くて永遠に見られることに気づいた。そして動画を見るうちに、国外の場所や人により親しみを感じるようになった。外国語の堪能な人がよくいう、外国語というよりその言語のコンテンツに没頭してできるようになった、の正しさを感じた</li>
<li>1ヶ月間アメリカに行った。英語で国外のコンテンツを見るうち、じっさいに行ってみたくなったのである。アメリカでは予約やメモをする以外はPCに全然触れず、ほとんど外にいて遊び回った。都市や自然の名所、博物館、美術館が主な行き先だった</li>
<li>休日よく博物館に行った。あまり行ってない時期もあったが、休日の午前に行くとよいことに気づいて安定した</li>
<li>毎日5分やる習慣が完全に定着した
<ul class="org-ul">
<li>6月ごろに<a href="20250611T180912--kdoc-385-『続ける思考』__book.html#ID-20250611T180912">KDOC 385: 『続ける思考』</a>を読んでやりはじめ、それから1日も欠かさず半年間やった</li>
<li>去年から続く<a href="20240708T214636--kdoc-197-『プリズナー・トレーニング』__book.html#ID-20240708T214636">KDOC 197: 『プリズナー・トレーニング』</a>に続く習慣上のブレイクスルーであり、継続力に大きな改善をもたらした</li>
</ul></li>
<li>後半からモバイル回線にもDNSフィルタリングを設定して、有害コンテンツを完全に遮断する生活をしていた。とくにポルノ依存に対する絶大な効果があった</li>
</ul>

<p>
個人的開発。
</p>

<ul class="org-ul">
<li>2Dローグライクの開発を大きく進めた。熱中しては静まって、を数回繰り返した。ゲームとして最低限成り立つまであと少しなのだが、なかなか手につかない</li>
<li>Go言語のコミットを読んでいく、というのを前半していたが果てしなさ過ぎてやめてしまった。深堀りするネタや意外な過去実装を発見できたのはよかった</li>
<li>Cloudflare Tunnel を使った自宅サーバを動かし始めた。インターネット公開する自由度が高まった
<ul class="org-ul">
<li>7年ほど契約し続けてきたレンタルサーバを解約して、自宅サーバに移行した。微妙に使っているところもあったのだが、時間をとってまとめて切り替えた</li>
<li>保有PDFをインターネットを介してどこからでも見られるようにした。Cloudflareが認証をやってくれるので非常に簡単であった</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org35c3942" class="outline-2">
<h2 id="org35c3942"><a href="#org35c3942">関連</a></h2>
<div class="outline-text-2" id="text-org35c3942">
<ul class="org-ul">
<li>類推: <a href="20240203T020208--kdoc-67-2023年をまとめる__essay.html#ID-20240203T020208">KDOC 67: 2023年をまとめる</a>。同様に1年を振り返る
<ul class="org-ul">
<li>2024年は抜けていることに気づいた</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
